// Циклы нужны для того, чтобы выполнить наш код боле 1го раза 
// В JS есть 3 вида циклов  
// 1) do/while
// do{
//     // выполняется код
// } while(условие)
// 2) while/do
// while(условие){
//     выполняется код
// }

// 3) for   
// for (let i =0;i<10;i++){
//     выполняется код
// }
// нужен в случае, когда необходимо выполнить фиксированное количество итераций
// let i = 0; Инициализация переменной которая будет работать счетчиком итераций
// < 10 Условие, при соблюдении котого цикл будет продолжать выполняться 
// while отличается от do while тем,что do while сначала выполняется и только потом проверяет условие. В том случае, если условие не выполняется, do while выполнится один раз, while - ни одного